app/views/indoor/new_registration.html.erb

SELECT "cities".* FROM "cities"
---
                <label class="col-sm-2 control-label">City:</label>
                <div class="col-sm-2"><%= c.select :city,@city.collect{|b| [b.city_name,b.id]},
                    onfocus:"$(this).popover('show');" ,
                     class: "form-control input-group",placeholder: "Ref Doctor",
                      required: true,
                      :"data-content"=>"Adm Type",
                      :"data-placement"=>"right",
                      :"data-toggle"=>"popover",:"data-trigger"=>"focus"