app/controllers/indoor_controller.rb

SELECT  "ipd_registrations".* FROM "ipd_registrations"   ORDER BY "ipd_registrations"."id" DESC LIMIT 1
SELECT "doctor_masters".* FROM "doctor_masters"
SELECT "cities".* FROM "cities"
---
	def new_registration
	@new_registration=IpdRegistration.new
	unless  IpdRegistration.last.nil?
	@new_registration.ipd_no=IpdRegistration.last.ipd_no.next
	@new_registration.hr_no=IpdRegistration.last.hr_no.next
	else
	@new_registration.ipd_no=1
	@new_registration.hr_no=1

	end
	@doctor_masters= DoctorMaster.all
	@city=City.all

INSERT INTO "ipd_registrations" ("address", "adm_type", "advance_booking", "advance_booking_check", "bed_no", "birthdate", "city", "co", "company_name", "created_at", "date", "diesease", "family", "gender", "height", "hr_no", "ipd_no", "marital_status", "occupation", "patient_name", "pin", "ref_dr", "relation", "relative_name", "relative_phone_no", "religion", "shift", "time", "under_dr_one", "under_dr_two", "updated_at", "ward_name", "weight") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33) RETURNING "id"
---
	def create_registration
		@ipd_registration=IpdRegistration.new(params_create_registration)
		if @ipd_registration.save